       IDENTIFICATION DIVISION.
           PROGRAM-ID. HELLOWORLD.
           AUTHOR. DIEGO TOSTES.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
       PRINCIPAL.
           DISPLAY "OLA MUNDO".

       STOP RUN.
       END PROGRAM HELLOWORLD. 
